# Análise de dados com Python e Pandas - Aula 2
### Digital innovation One - 20/10/2022

In [2]:
import pandas as pd

In [3]:
df1 = pd.read_excel('/home/cicero_hitzschky/Desktop/Dio/DataScientist/AnaliseDadosPandas/datasets/Aracaju.xlsx')
df2 = pd.read_excel('/home/cicero_hitzschky/Desktop/Dio/DataScientist/AnaliseDadosPandas/datasets/Fortaleza.xlsx')
df3 = pd.read_excel('/home/cicero_hitzschky/Desktop/Dio/DataScientist/AnaliseDadosPandas/datasets/Natal.xlsx')
df4 = pd.read_excel('/home/cicero_hitzschky/Desktop/Dio/DataScientist/AnaliseDadosPandas/datasets/Recife.xlsx')
df5 = pd.read_excel('/home/cicero_hitzschky/Desktop/Dio/DataScientist/AnaliseDadosPandas/datasets/Salvador.xlsx')

In [4]:
# juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [5]:
df.head()
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [6]:
# Pegando uma amostra do nosso conjunto de dados

df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
57   Fortaleza 2019-01-01  129.07    1005     3
40     Aracaju 2018-01-01    6.99    1522     7
64      Recife 2019-01-01   89.32     983     2
195      Natal 2019-01-02   44.89    1036     3
194      Natal 2019-01-02  156.47    1035     1

In [7]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [8]:
# alterando o tipo de dado da coluna LojaID
df['LojaID'] = df['LojaID'].astype('object') 

df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

## Tratando valores faltantes

In [9]:
# Consultando linhas com valores faltantes (nulos)
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [10]:
# Substituindo valores nulos pela média
df['Vendas'].fillna(df['Vendas'].mean(),inplace=True)

In [11]:
#Apaga valores nulos
df.dropna(inplace=True)

In [12]:
# Apagando linhas com valores nulos baseando-se apenas em 1 coluna
df.dropna(subset=['Vendas'],inplace=True)

In [13]:
# Removendo linhas que estejam com valores flatantes em todas as colunas
df.dropna(how='all', inplace=True)

## Criando colunas novas

In [14]:
# Criando uma coluna de receita

df['Receita'] = df['Vendas'].mul(df['Qtde'])

In [15]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [16]:
df['Receita/vendas'] = df['Receita']/df['Vendas']

In [17]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [18]:
# nlargest
df.nlargest(3,'Receita')

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [19]:
df.nsmallest(3,'Receita')

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [20]:
# Agrupamento por cidade

df.groupby('Cidade')['Receita'].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [21]:
# Ordenando o conjunto de dados
df.sort_values('Receita',ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

## Trabalhando com Datas

In [22]:
# tranformando a coluna de ada em tipo inteiro 
df["Data"] = df["Data"].astype('int64')

In [24]:
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/vendas    float64
dtype: object

In [25]:
df['Data'] = pd.to_datetime(df['Data'])

In [26]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/vendas           float64
dtype: object

In [27]:
# Agrupamento por ano
df.groupby(df["Data"].dt.year)['Receita'].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64